       IDENTIFICATION DIVISION.
           PROGRAM-ID. HELLOWORLD.
           AUTHOR. Aaron Yan.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "Hello World".
           
       STOP RUN.
       END PROGRAM HELLOWORLD.
